src/cfe/МенеджерСинхронизаций/Catalogs/МС_НастройкиПодключений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>МС_НастройкиПодключений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодПодключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПодключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/МенеджерСинхронизаций/Catalogs/МС_НастройкиПодключений/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьСоединение(НастройкаПодключенияСсылка) Экспорт
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Соединение", Неопределено);
	СтруктураВозврата.Вставить("СтрокаОшибок", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&Пароль КАК Пароль,
	|	*
	|ИЗ
	|	Справочник.МС_НастройкиПодключений КАК МС_НастройкиПодключений
	|ГДЕ
	|	МС_НастройкиПодключений.Ссылка = &НастройкаПодключенияСсылка";
	
	Запрос.УстановитьПараметр("НастройкаПодключенияСсылка", НастройкаПодключенияСсылка);
	УстановитьПривилегированныйРежим(Истина);
	Запрос.УстановитьПараметр("Пароль", ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Строка(НастройкаПодключенияСсылка.УникальныйИдентификатор()), "Пароль"));
	УстановитьПривилегированныйРежим(Ложь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		СтруктураВозврата.СтрокаОшибок = "В базе отстутствует ссылка на настройку подключения";
		Возврат СтруктураВозврата;
	Иначе
		НастройкаПодключения = РезультатЗапроса.Выбрать();
		НастройкаПодключения.Следующий();
	КонецЕсли; 
	
	Попытка
		
		СтрокаПодключения = Вычислить(НастройкаПодключения.СтрокаПодключения);
		
		// Стандартная переменная, есть всегда
		Соединение = Неопределено;
		
		Выполнить(НастройкаПодключения.КодПодключения);

		Выполнить("СтруктураВозврата.Соединение = Соединение;");
		
	Исключение
		
		СтруктураВозврата.СтрокаОшибок = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат СтруктураВозврата;
	
КонецФункции
 
#КонецЕсли
